import os

PATH = 'C:/Users/kindk/OneDrive/OCWOOD_OFFICE/002_매입처/01_수신팩스/'
# KEY_FILENAME = 0
# KEY_FORDER = 1


forder_list = {
    '경비':        '경비',
    '기타':        '기타',
    '건한':        '건한_철물',
    '구산목재':    '구산목재_목재',
    '남창':        '남창_목재',
    '다인디앤씨':  '다인디앤씨(오일스테인)철물',
    '대한테이프':  '대한테이프_철물',
    '대현우드':    '대현우드_목재',
    '두산종합목재':'두산종합목재',
    '락소':        '락소_히든몰딩_몰딩',
    '마운틴우드':  '마운틴우드_목재',
    '미래상사':    '미래상사_몰딩',
    '방음랜드':    '방음랜드_흡음재',
    '벽산':        '벽산_단열재',
    '벽산인슈-예스건축자재':'벽산인슈:예스건축자재_단열재',
    '복음단열':    '복음단열_단열재',
    '삼원목재':    '삼원목재_합판',
    '에스디팀버':  '에스디팀버_목재',
    '예성템바':    '예성템바_몰딩',
    '오스방음':    '오스방음_흡음재',
    '우드마트':    '우드마트_목재',
    '우진프레임':  '우진프레임_몰딩',
    '케이디우드':  '케이디우드_합판',
    '케이론몰딩':  '케이론몰딩_몰딩',
    '케이씨씨':    '케이씨씨_석고',
    '크나우프':    '크나우프_석고',
    '태신합판':    '태신합판_합판',
    '태진목재':    '태진목재_목재',
    '팀버마스타':  '팀버마스타_목재',
    '하이우드':    '하이우드_몰딩',
    '한국스츠로폼':'한국스츠로폼_단열재',
    '한성우드':    '한성우드_목재',
    '형제철물':    '형제철물_철물',
    '홍진테크':    '홍진테크_흡음재',
}


# for key in forder_list.keys(): 
#     f = PATH + forder_list[key[1
    
#     print(f'{key} : {os.path.isdir(f)}')



    


