import os

PATH = 'C:/Users/kindk/OneDrive/OCWOOD_OFFICE/002_매입처/01_수신팩스/'
KEY_FILENAME = 0
KEY_FORDER = 1


forder_list = {
    1:  ['경비',        '01_경비'],
    2:  ['기타',        '02_기타'],
    3:  ['건한',        '03_건한_철물'],
    4:  ['구산목재',    '04_구산목재_목재'],
    5:  ['남창',        '05_남창_목재'],
    6:  ['다인디앤씨',  '06_다인디앤씨(오일스테인)철물'],
    7:  ['대한테이프',  '07_대한테이프_철물'],
    8:  ['대현우드',    '08_대현우드_목재'],
    9:  ['두산종합목재','09_두산종합목재'],
    10: ['락소',        '10_락소_히든몰딩_몰딩'],
    11: ['마운틴우드',  '11_마운틴우드_목재'],
    12: ['미래상사',    '12_미래상사_몰딩'],
    13: ['방음랜드',    '13_방음랜드_흡음재'],
    14: ['벽산',        '14_벽산_단열재'], 
    15: ['벽산인슈-예스건축자재','15_벽산인슈,예스건축자재_단열재'],
    16: ['복음단열',    '16_복음단열_단열재'],
    17: ['삼원목재',    '17_삼원목재_합판'],
    18: ['에스디팀버',  '18_에스디팀버_목재'],
    19: ['예성템바',    '19_예성템바_몰딩'],
    20: ['오스방음',    '20_오스방음_흡음재'],
    21: ['우드마트',    '21_우드마트_목재'],
    22: ['우진프레임',  '22_우진프레임_몰딩'],
    23: ['케이디우드',  '23_케이디우드_합판'],
    24: ['케이론몰딩',  '24_케이론몰딩_몰딩'],
    25: ['케이씨씨',    '25_케이씨씨_석고'],
    26: ['크나우프',    '26_크나우프_석고'],
    27: ['태신합판',    '27_태신합판_합판'],
    28: ['태진목재',    '28_태진목재_목재'],
    29: ['팀버마스타',  '29_팀버마스타_목재'],
    30: ['하이우드',    '30_하이우드_몰딩'],
    31: ['한국스츠로폼','31_한국스츠로폼_단열재'],
    32: ['한성우드',    '32_한성우드_목재'],
    33: ['형제철물',    '33_형제철물_철물'],
    34: ['홍진테크',    '34_홍진테크_흡음재'],
}


# for key in forder_list.keys(): 
#     f = PATH + forder_list[key][1]
    
#     print(f'{key} : {os.path.isdir(f)}')



    


