companies_name  =[
                            "한국산업",
                            "건한",
                            "나산팀버",
                            "대한테이프",
                            "단가표",
                            "두산종합목재",
                            "삼원목재",
                            "에스디팀버",
                            "온보드",
                            "우진프레임",
                            "원스탑우드",
                            "진양",
                            "케이디우드",
                            "크나우프",
                            "태진목재",
                            "사업자",
                            "기타",
                            "경비_주유소",
                            "경비_경동화물",
                            "경비_대신화물"
            
        ]

companies_name.remove('진양')
print(companies_name)